# Multidimensional Arrays

import numpy as np

def main():
    
    # 一維陣列
    one_dimensional = np.array([
        "維他命D","葉黃素","蔓越莓錠","B群","綜合維他命","益生菌","維他命C"
    ])
    print(one_dimensional)
    
    # 二維陣列
    # 範例: 上午、中午、下午；對應星期幾要吃的營養素
    two_dimensional = np.array([["維他命D","葉黃素","蔓越莓錠","B群","綜合維他命","益生菌","維他命C"], 
                                ["葉黃素","蔓越莓錠","B群","綜合維他命","益生菌","維他命C","維他命D"],
                                ["蔓越莓錠","B群","綜合維他命","益生菌","維他命C","維他命D","葉黃素"]
                                ])
    print(two_dimensional, two_dimensional.ndim)
    print(two_dimensional[2, 5]) # 取出2=下午；5=星期六
    
    # 三維陣列
    three_dimensional = np.array([[["維他命D","葉黃素","蔓越莓錠","B群","綜合維他命","益生菌","維他命C"],
                                   ["葉黃素","蔓越莓錠","B群","綜合維他命","益生菌","維他命C","維他命D"],
                                   ["蔓越莓錠","B群","綜合維他命","益生菌","維他命C","維他命D","葉黃素"]],
                                  [["維他命D","益生菌","蔓越莓錠","B群","綜合維他命","葉黃素","維他命C"],
                                   ["維他命C","蔓越莓錠","B群","綜合維他命","益生菌","葉黃素","維他命D"],
                                   ["維他命D","綜合維他命","B群","益生菌","維他命C","蔓越莓錠","葉黃素"]],
                                  [["維他命D","葉黃素","蔓越莓錠","B群","綜合維他命","益生菌","維他命C"],
                                   ["葉黃素","蔓越莓錠","B群","綜合維他命","益生菌","維他命C","維他命D"],
                                   ["蔓越莓錠","B群","綜合維他命","益生菌","維他命C","維他命D","葉黃素"]],
                                  [["維他命D","葉黃素","蔓越莓錠","B群","綜合維他命","益生菌","維他命C"],
                                   ["葉黃素","益生菌","B群","綜合維他命","蔓越莓錠","維他命C","維他命D"],
                                   ["蔓越莓錠","B群","葉黃素","益生菌","維他命C","維他命D","綜合維他命"]]])
    
    # 第四周，星期日，晚上
    print(three_dimensional[3, 2, 6]) # 3=第四周, 2=晚上, 6=星期日

def test_day02():
    
    Maps = np.array([['X','I','W','Z'],
                     ['A','B','C','E'],
                     ['L','P','D','F'],
                     ['M','Q','V','G'],
                     ['N','O','A','H'],
                     ['S','R','X','I'],
                     ['T','U','K','J'],
                     ['Z','N','V','c']
                     ])
    print(Maps[2,2], Maps[0,1], Maps[3,0], Maps[1,3], Maps[4,0], Maps[5,0], \
        Maps[5,3], Maps[4,1], Maps[7,1])
    
if __name__ == "__main__":
    # main()
    test_day02()